test/fixtures/xml/send_service/SendMessageRequest.xml

<?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tns="com.esendex.ems.soapinterface" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><env:Header/><env:Body><tns:sendMessage xmlns="com.esendex.ems.soapinterface"><body>BODY</body><date>2018-01-19</date><recipient>WSPB</recipient><type>TYPE</type></tns:sendMessage></env:Body></env:Envelope>
