test/fixtures/xml/send_service/SendMessageRequest_soap12.xml

<?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope" xmlns:tns="com.esendex.ems.soapinterface" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><soapenv:Header></soapenv:Header><soapenv:Body><tns:sendMessage xmlns="com.esendex.ems.soapinterface"><body>BODY</body><date>2018-01-19</date><recipient>WSPB</recipient><type>TYPE</type></tns:sendMessage></soapenv:Body></soapenv:Envelope>